In [1]:
!pwd

/c/Users/osori/Desktop/project/corey_pandas/09-Cleaning_Data

In [3]:
import pandas as pd
import numpy as np

In [5]:
people = {
    'first':['Corey','Jane','John','Chris',np.nan,None, 'NA'],
    'last':['Schafer','Doe','Doe','Schafer',np.nan, np.nan, 'Missing'],
    'email':['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com',None,np.nan,'Anonymouse@email.com','NA'],
    'age':['33','55','63','36',None,None,'Missing']
    
}

In [6]:
df = pd.DataFrame(people)

In [7]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN     Anonymouse@email.com     None
6     NA  Missing                       NA  Missing

In [9]:
df.dropna() # 3,4,5 인덱스가 삭제된걸 return 함(None, NaN)

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [10]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN     Anonymouse@email.com     None
6     NA  Missing                       NA  Missing

In [16]:
# 좀더 살펴보기
df.dropna(axis='columns', how='all') # axis=0 또는 axis='index'를 하면 row 하나에 모든 값이 NaN, None 값일때 그 row를 삭제함
                                     # axis=1 또는 axis='columns'를 하면 columns 하나에 모든 값이 NaN, None 값일때 그 column을 삭제함

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN     Anonymouse@email.com     None
6     NA  Missing                       NA  Missing

In [17]:
# 좀더 살펴보기
df.dropna(axis='columns', how='any') # axis=0 또는 axis='index'를 하면 row에 어떠헌 값이라도 NaN, None 값이면 그 row를 삭제함
                                     # axis=1 또는 axis='columns'를 하면 columns에 어떠헌 값이라도 NaN, None 값이면 그 column을 삭제함

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [23]:
# dropna(subset=? )
df.dropna(axis='index', how='all',subset=['email','last']) # last,email 열만 적용되어 return. last와 email 모두 NaN인 4번index만 삭제된것임.

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN     Anonymouse@email.com     None
6     NA  Missing                       NA  Missing

In [ ]:
# customized missing value 삭제 방법

In [24]:
people = {
    'first':['Corey','Jane','John','Chris',np.nan,None, 'NA'],
    'last':['Schafer','Doe','Doe','Schafer',np.nan, np.nan, 'Missing'],
    'email':['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com',None,np.nan,'Anonymouse@email.com','NA'],
    'age':['33','55','63','36',None,None,'Missing']
    
}

df = pd.DataFrame(people)
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

# 'NA', 'Missing'이라고 입력된 모든 value들이 NaN값으로 변환됨.

In [25]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN     Anonymouse@email.com  None
6    NaN      NaN                      NaN   NaN

In [26]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [27]:
df.dropna(axis='index', how='all',subset=['email','last'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN     Anonymouse@email.com  None

In [29]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN     Anonymouse@email.com  None
6    NaN      NaN                      NaN   NaN

In [28]:
df.isna() # NaN, None 값이 있는 cell은 True로 반환함.

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [38]:
# fillna() NaN, None value ==> '특정 값' 변환. 여기선 'MISSING"
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING     Anonymouse@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [39]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [42]:
type(np.nan)

float

In [44]:
type(None)

NoneType

In [41]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [43]:
df['age'] = df['age'].astype(int)

TypeError: int() argument must be a string, a bytes-like object or a number, not 'NoneType'

In [46]:
df['age'] = df['age'].astype(float)

In [48]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [49]:
df['age'].mean()

46.75